FemDesign.InternalPanels
internal_panels. List of internal_panel_type, used for struxml heirarchy.

FemDesign.InternalPanels.#ctor
Parameterless constructor for serialization.

FemDesign.InternalPanels.#ctor(FemDesign.InternalPanel)
Construct InternalPanels object from a single internal panel.

FemDesign.InternalPanels.#ctor(System.Collections.Generic.List{FemDesign.InternalPanel})
Construct InternalPanels object from List of internal panels.